opencds-parent/opencds-decision-support-service/opencds-knowledge-repository-data/resources_v1.1/pacientes/ExampleDSSEvaluationRequestSampleSOAPWrapper_NQF_0031.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope 
        xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope" 
        xmlns:dss="http://www.omg.org/spec/CDSS/201012/dss">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <dss:evaluateAtSpecifiedTime>
            <interactionId scopingEntityId="edu.utah" interactionId="123456" submissionTime="2012-01-31T00:00:00.000"/>
            <specifiedTime>2012-01-01T00:00:00.000</specifiedTime><!-- by definition this is midnight, the instant of the start of the year 2012, and the end of 2011 -->
            <!-- note that a specifiedTime = "2011-12-31" may be interpreted as midnight, the beginning of the last day of the year, and you probably don't mean that -->
            <evaluationRequest>
                <kmEvaluationRequest>
                    <kmId scopingEntityId="org.opencds" businessId="NQF_0031_v1" version="1.0.0"/>
                </kmEvaluationRequest>
                <dataRequirementItemData>
                    <driId itemId="payload001">
                        <containingEntityId scopingEntityId="edu.utah" businessId="123.456.7.8.2.1" version="1.0.0"/>
                    </driId>
                    <data>
                        <informationModelSSId scopingEntityId="org.opencds.vmr" businessId="VMR" version="1.0"/>
                        <base64EncodedPayload></base64EncodedPayload>
                    </data>
                </dataRequirementItemData>
            </evaluationRequest>
        </dss:evaluateAtSpecifiedTime>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
